CROP_CODES = {
    # 과수
    "사과": "cr005",
    "배": "cr006",
    "포도": "cr007",
    "감귤": "cr008",
    "참다래": "cr009",
    "매실": "cr010",
    "유자": "cr011",
    "단감": "cr012",
    "복숭아": "cr013",
    "복분자": "cr062",
    "무화과": "cr065",

    # 과채류
    "수박": "cr014",
    "참외": "cr015",
    "딸기": "cr016",
    "오이": "cr017",
    "토마토": "cr018",
    "메론": "cr019",
    "호박": "cr020",
    "가지": "cr021",
    "고추": "cr022",
    "피망": "cr023",

    # 엽채류
    "배추": "cr038",
    "양배추": "cr039",
    "시금치": "cr040",
    "쑥갓": "cr041",
    "샐러리": "cr047",
    "신선초": "cr046",
    "상추": "cr044",
    "양상추": "cr045",
    "케일": "cr043",
    "부추": "cr042",
    "대파": "cr066",

    # 근채류
    "당근": "cr029",
    "우엉": "cr025",
    "무": "cr028",
    "생강": "cr027",
    "도라지": "cr026",
    "마": "cr024",

    # 인경채류
    "양파": "cr048",
    "마늘": "cr049",

    # 곡류
    "보리": "cr057",
    "옥수수": "cr001",
    "밀": "cr058",
    "수수": "cr002",
    "메밀": "cr004",
    "조": "cr003",

    # 두류
    "콩": "cr030",
    "논콩": "cr031",
    "팥": "cr064",

    # 서류
    "감자": "cr032",
    "고구마": "cr033",

    # 유지작물
    "참깨": "cr034",
    "들깨": "cr035",
    "땅콩": "cr036",
    "유채": "cr037",

    # 약용작물
    "황기": "cr053",
    "오미자": "cr052",
    "구기자": "cr050",
    "당귀": "cr054",
    "강활": "cr055",
    "산수유": "cr051",
    "맥문동": "cr063",
    "인삼": "cr056",

    # 산채류
    "곰취": "cr059",
    "참취": "cr060",
    "곤달비": "cr061",
    "고사리": "cr067",
}


SUITABILITY = {
    "01": {
        "name": "최적지",
        "score": 40,
        "suitable": True
    },
    "02": {
        "name": "적지",
        "score": 32,
        "suitable": True
    },
    "03": {
        "name": "가능지",
        "score": 16,
        "suitable": False
    },
    "04": {
        "name": "저위생산지",
        "score": 5,
        "suitable": False
    },
    "99": {
        "name": "기타",
        "score": 0,
        "suitable": False
    }
}
